{"version": "1.0", "encoding": "UTF-8", "feed": {"xmlns": "http://www.w3.org/2005/Atom", "xmlns$openSearch": "http://a9.com/-/spec/opensearchrss/1.0/", "xmlns$gsx": "http://schemas.google.com/spreadsheets/2006/extended", "id": {"$t": ""}, "updated": {"$t": "2020-09-30T11:59:58.779Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Artists_"}, "link": [{"rel": "alternate", "type": "application/atom+xml", "href": ""}, {"rel": "http://schemas.google.com/g/2005#feed", "type": "application/atom+xml", "href": ""}, {"rel": "http://schemas.google.com/g/2005#post", "type": "application/atom+xml", "href": ""}, {"rel": "self", "type": "application/atom+xml", "href": ""}], "author": [{"name": {"$t": ""}, "email": {"$t": "gmail.com"}}], "openSearch$totalResults": {"$t": "11"}, "openSearch$startIndex": {"$t": "1"}, "entry": [{"id": {"$t": ""}, "updated": {"$t": "2020-09-30T11:59:58.779Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Andreas Ladommatos"}, "content": {"type": "text", "$t": "name-el: Ανδρέας Λαδόμματος, yearbirth: 1940, biography-en: Born in Nicosia. Studied painting at the Camberwell School of Art, London. Has exhibited his work in Cyprus and abroad (Greece, Hungary, Romania, Bulgaria, India, Egypt, Poland, Brazil, Uruguay)., biography-el: Γεννήθηκε στη Λευκωσία. Σπούδασε ζωγραφική στο Camberwell School of Art του Λονδίνου. Εξέθεσε έργα του στην Κύπρο και στο εξωτερικό, όπως Ελλάδα, Ουγγαρία, Ρουμανία, Βουλγαρία, Ινδία, Αίγυπτο, Πολωνία, Βραζιλία, Ουρουγουάη., id: andreas_ladommatos"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Andreas Ladommatos"}, "gsx$name-el": {"$t": "Ανδρέας Λαδόμματος"}, "gsx$yearbirth": {"$t": "1940"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography-en": {"$t": "Born in Nicosia. Studied painting at the Camberwell School of Art, London. Has exhibited his work in Cyprus and abroad (Greece, Hungary, Romania, Bulgaria, India, Egypt, Poland, Brazil, Uruguay)."}, "gsx$biography-el": {"$t": "Γεννήθηκε στη Λευκωσία. Σπούδασε ζωγραφική στο Camberwell School of Art του Λονδίνου. Εξέθεσε έργα του στην Κύπρο και στο εξωτερικό, όπως Ελλάδα, Ουγγαρία, Ρουμανία, Βουλγαρία, Ινδία, Αίγυπτο, Πολωνία, Βραζιλία, Ουρουγουάη."}, "gsx$id": {"$t": "andreas_ladommatos"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-30T11:59:58.779Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Andis Bargilly"}, "content": {"type": "text", "$t": "name-el: Άντης Παρτζίλης, yearbirth: 1947, biography-en: Born in Famagusta. Studied costume and stage design at the Higher Academy of Applied Arts and Music in Prague. Has exhibited his work in Cyprus and abroad (Greece, France, Yugoslavia, Czechoslovakia)., biography-el: Γεννήθηκε στην Αμμόχωστο. Σπούδασε ενδυματολογία και σκηνογραφια στην Ανώτατη Ακαδημία Εφηρμοσμένων και Μουσικών Τεχνών Πράγας. Εξέθεσε έργα του στην Κύπρο και στο εξωτερικό, όπως Ελλάδα, Γιουγκοσλαβία, Γαλλία, Τσεχοσλοβακία., id: andis_bargilly"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Andis Bargilly"}, "gsx$name-el": {"$t": "Άντης Παρτζίλης"}, "gsx$yearbirth": {"$t": "1947"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography-en": {"$t": "Born in Famagusta. Studied costume and stage design at the Higher Academy of Applied Arts and Music in Prague. Has exhibited his work in Cyprus and abroad (Greece, France, Yugoslavia, Czechoslovakia)."}, "gsx$biography-el": {"$t": "Γεννήθηκε στην Αμμόχωστο. Σπούδασε ενδυματολογία και σκηνογραφια στην Ανώτατη Ακαδημία Εφηρμοσμένων και Μουσικών Τεχνών Πράγας. Εξέθεσε έργα του στην Κύπρο και στο εξωτερικό, όπως Ελλάδα, Γιουγκοσλαβία, Γαλλία, Τσεχοσλοβακία."}, "gsx$id": {"$t": "andis_bargilly"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-30T11:59:58.779Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Andreas Chrysochos"}, "content": {"type": "text", "$t": "name-el: Ανδρέας Χρυσοχός, yearbirth: 1929, biography-en: Born in Famagusta. Studied at Goldsmith's College School of Art in London and N.E. London Polytechnic. Has exhibited his work in Cyprus and abroad (Greece, Egypt, America, India, England, Spain, Bulgaria, Hungary, Czechoslovakia, Romania, Yugoslavia, France)., biography-el: Γεννήθηκε στην Αμμόχωστο. Σπούδασε στο Goldsmith's College School of Art στο Λονδίνο. Εξέθεσε έργα του στην Κύπρο και στο εξωτερικό, όπως Ελλάδα, Αίγυπτο, Αμερική, Ινδία, Αγγλία, Ισπανία, Βουλγαρία, Ουγγαρία, Τσεχοσλοβακία, Ρουμανία, Γιουγκοσλαβία, Γαλλία., id: andreas_chrysochos"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Andreas Chrysochos"}, "gsx$name-el": {"$t": "Ανδρέας Χρυσοχός"}, "gsx$yearbirth": {"$t": "1929"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography-en": {"$t": "Born in Famagusta. Studied at Goldsmith's College School of Art in London and N.E. London Polytechnic. Has exhibited his work in Cyprus and abroad (Greece, Egypt, America, India, England, Spain, Bulgaria, Hungary, Czechoslovakia, Romania, Yugoslavia, France)."}, "gsx$biography-el": {"$t": "Γεννήθηκε στην Αμμόχωστο. Σπούδασε στο Goldsmith's College School of Art στο Λονδίνο. Εξέθεσε έργα του στην Κύπρο και στο εξωτερικό, όπως Ελλάδα, Αίγυπτο, Αμερική, Ινδία, Αγγλία, Ισπανία, Βουλγαρία, Ουγγαρία, Τσεχοσλοβακία, Ρουμανία, Γιουγκοσλαβία, Γαλλία."}, "gsx$id": {"$t": "andreas_chrysochos"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-30T11:59:58.779Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Vera Hadjida"}, "content": {"type": "text", "$t": "name-el: Βέρα Χατζηδά, yearbirth: 1936, yeardeath: 2012, biography-en: Born in Nicosia. Studied at the Kingston School of Art, Surrey. Has exhibited her work in Cyprus and abroad (France, America, India, England, Greece, Czechoslovakia, Hungary, Germany, Romania, Yugoslavia, Bulgaria, Brazil)., biography-el: Γεννήθηκε στη Λευκωσία. Σπούδασε στο Kingston School of Art, Surrey. Εξέθεσε στην Κύπρο και στη Γαλλία, Αμερική, Ινδία, Αγγλία, Ελλάδα, Τσεχοσλοβακία, Ουγγαρία, Γερμανία, Ρουμανία, Γιουγκοσλαβία, Βουλγαρία, Βραζιλία., id: vera_hadjida"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Vera Hadjida"}, "gsx$name-el": {"$t": "Βέρα Χατζηδά"}, "gsx$yearbirth": {"$t": "1936"}, "gsx$yeardeath": {"$t": "2012"}, "gsx$biography-en": {"$t": "Born in Nicosia. Studied at the Kingston School of Art, Surrey. Has exhibited her work in Cyprus and abroad (France, America, India, England, Greece, Czechoslovakia, Hungary, Germany, Romania, Yugoslavia, Bulgaria, Brazil)."}, "gsx$biography-el": {"$t": "Γεννήθηκε στη Λευκωσία. Σπούδασε στο Kingston School of Art, Surrey. Εξέθεσε στην Κύπρο και στη Γαλλία, Αμερική, Ινδία, Αγγλία, Ελλάδα, Τσεχοσλοβακία, Ουγγαρία, Γερμανία, Ρουμανία, Γιουγκοσλαβία, Βουλγαρία, Βραζιλία."}, "gsx$id": {"$t": "vera_hadjida"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-30T11:59:58.779Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Nicos Kouroussis"}, "content": {"type": "text", "$t": "name-el: Νίκος Κουρούσιης, yearbirth: 1937, biography-en: Born at Mitsero. Studied painting at St. Martin's School of Art in London and at Hornsey College of Art. Later he studied stage design in England. Has exhibited his work in Cyprus and abroad (India, France, Greece, Spain, Yugoslavia, Brazil, Germany, Norway, U.S.A.)., biography-el: Γεννήθηκε στο Μιτσερό. Σπούδασε ζωγραφική στο Saint Martin's School of Art του Λονδίνου και στο Hornsey College of Art. Αργότερα σπούδασε σκηνογραφία στην Αγγλία. Εξέθεσε έργα του στην Κύπρο και στο εξωτερικό, όπως Ινδία, Ιταλία, Ελλάδα, Ισπανία, Γιουγκοσλαβία, Βραζιλία, Γερμανία, Νορβηγία, Η.Π.Α., id: nicos_kouroussis"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Nicos Kouroussis"}, "gsx$name-el": {"$t": "Νίκος Κουρούσιης"}, "gsx$yearbirth": {"$t": "1937"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography-en": {"$t": "Born at Mitsero. Studied painting at St. Martin's School of Art in London and at Hornsey College of Art. Later he studied stage design in England. Has exhibited his work in Cyprus and abroad (India, France, Greece, Spain, Yugoslavia, Brazil, Germany, Norway, U.S.A.)."}, "gsx$biography-el": {"$t": "Γεννήθηκε στο Μιτσερό. Σπούδασε ζωγραφική στο Saint Martin's School of Art του Λονδίνου και στο Hornsey College of Art. Αργότερα σπούδασε σκηνογραφία στην Αγγλία. Εξέθεσε έργα του στην Κύπρο και στο εξωτερικό, όπως Ινδία, Ιταλία, Ελλάδα, Ισπανία, Γιουγκοσλαβία, Βραζιλία, Γερμανία, Νορβηγία, Η.Π.Α."}, "gsx$id": {"$t": "nicos_kouroussis"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-30T11:59:58.779Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "George Kyriakou"}, "content": {"type": "text", "$t": "name-el: Γιώργος Κυριάκου, yearbirth: 1940, biography-en: Born in Exo-Metochi, in 1940. He is a trained teacher and worked as a primary school teacher before getting a scholarship to study Art. He studied Sculpture at the Chelsea School of Art. London, from 1961–1964. He taught Art at the Gymnasiums between 1964–1969. He is an Assistant Cultural Officer at the Ministry of Education. He has participated in the annual exhibitions of EKATE. He showed work with a group of Cypriot artists in Cairo in 1966, the Panhellenic Exhibition, Athens, 1967, at the Mediterranean Biennale, Alexandria, in 1968, at the Biennale Des Jeunes, Paris, 1967 and at the Venice Biennale in 1968, and the group exhibition of 6 Cypriot artists at the Hilton Gallery, Athens in 1969. One-man show in 1969 at the Hilton Gallery, Nicosia., biography-el: Γεννήθηκε στο Έξω-Μετόχι το 1940. Εκπαιδεύτηκε σαν δάσκαλος και εργάστηκε για δυο χρόνια προτού πάρει υποτροφία για σπουδές στην Τέχνη. Παρακολούθησε Γλυπτική στο Chelsea School of Art του Λονδίνου από το 1961–1964. Εργάστηκε καθηγητής στη Μ. Παιδεία για πέντε χρόνια. Είναι Β. Μορφωτικός Λειτουργός του Υπουργείου Παιδείας από το 1969. Από το 1964 παίρνει μέρος στις ετήσιες Παγκύπριες Εκθέσεις Ζωγραφικής και Γλυπτικής που οργανώνει το ΕΚΑΤΕ. 'Εξέθεσε έργα στο Κάιρο το 1966, στην Πανελλήνιο το 1967, στην Μπιεννάλε Αλεξανδρείας το 1968, στην Μπιεννάλε Νέων του Παρισιού το 1967 και Βενετίας το 1968 και στην ομαδική έκθεση 6 Κυπρίων καλλιτεχνών στο Χίλτον Αθηνών το 1969. Διοργάνωσε ατομική έκθεση στο Χίλτον Λευκωσίας το 1969., id: george_kyriakou"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "George Kyriakou"}, "gsx$name-el": {"$t": "Γιώργος Κυριάκου"}, "gsx$yearbirth": {"$t": "1940"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography-en": {"$t": "Born in Exo-Metochi, in 1940. He is a trained teacher and worked as a primary school teacher before getting a scholarship to study Art. He studied Sculpture at the Chelsea School of Art. London, from 1961–1964. He taught Art at the Gymnasiums between 1964–1969. He is an Assistant Cultural Officer at the Ministry of Education. He has participated in the annual exhibitions of EKATE. He showed work with a group of Cypriot artists in Cairo in 1966, the Panhellenic Exhibition, Athens, 1967, at the Mediterranean Biennale, Alexandria, in 1968, at the Biennale Des Jeunes, Paris, 1967 and at the Venice Biennale in 1968, and the group exhibition of 6 Cypriot artists at the Hilton Gallery, Athens in 1969. One-man show in 1969 at the Hilton Gallery, Nicosia."}, "gsx$biography-el": {"$t": "Γεννήθηκε στο Έξω-Μετόχι το 1940. Εκπαιδεύτηκε σαν δάσκαλος και εργάστηκε για δυο χρόνια προτού πάρει υποτροφία για σπουδές στην Τέχνη. Παρακολούθησε Γλυπτική στο Chelsea School of Art του Λονδίνου από το 1961–1964. Εργάστηκε καθηγητής στη Μ. Παιδεία για πέντε χρόνια. Είναι Β. Μορφωτικός Λειτουργός του Υπουργείου Παιδείας από το 1969. Από το 1964 παίρνει μέρος στις ετήσιες Παγκύπριες Εκθέσεις Ζωγραφικής και Γλυπτικής που οργανώνει το ΕΚΑΤΕ. 'Εξέθεσε έργα στο Κάιρο το 1966, στην Πανελλήνιο το 1967, στην Μπιεννάλε Αλεξανδρείας το 1968, στην Μπιεννάλε Νέων του Παρισιού το 1967 και Βενετίας το 1968 και στην ομαδική έκθεση 6 Κυπρίων καλλιτεχνών στο Χίλτον Αθηνών το 1969. Διοργάνωσε ατομική έκθεση στο Χίλτον Λευκωσίας το 1969."}, "gsx$id": {"$t": "george_kyriakou"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-30T11:59:58.779Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Angelos Makrides"}, "content": {"type": "text", "$t": "name-el: Άγγελος Μακρίδης, yearbirth: 1942, biography-en: Born at Yialousa, Famagusta. Studied sculpture at the Higher School of Fine Arts, Athens. Has exhibited his work in Cyprus and abroad (Brazil, Egypt, Yugoslavia, India, France, Italy, Greece)., biography-el: Γεννήθηκε στη Γιαλούσα Αμμοχώστου. Σπούδασε γλυπτική στην Ανωτάτη Σχολή Καλών Τεχνών της Αθήνας. Εξέθεσε έργα του στην Κύπρο και στο εξωτερικό, όπως Βραζιλία, Αίγυπτο, Γιουγκοσλαβία, Ινδία, Γαλλία, Ιταλία, Ελλάδα., id: angelos_makrides"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Angelos Makrides"}, "gsx$name-el": {"$t": "Άγγελος Μακρίδης"}, "gsx$yearbirth": {"$t": "1942"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography-en": {"$t": "Born at Yialousa, Famagusta. Studied sculpture at the Higher School of Fine Arts, Athens. Has exhibited his work in Cyprus and abroad (Brazil, Egypt, Yugoslavia, India, France, Italy, Greece)."}, "gsx$biography-el": {"$t": "Γεννήθηκε στη Γιαλούσα Αμμοχώστου. Σπούδασε γλυπτική στην Ανωτάτη Σχολή Καλών Τεχνών της Αθήνας. Εξέθεσε έργα του στην Κύπρο και στο εξωτερικό, όπως Βραζιλία, Αίγυπτο, Γιουγκοσλαβία, Ινδία, Γαλλία, Ιταλία, Ελλάδα."}, "gsx$id": {"$t": "angelos_makrides"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-30T11:59:58.779Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Michael Phinikarides"}, "content": {"type": "text", "$t": "name-el: Μιχαήλ Φοινικαρίδης, yearbirth: 1940, yeardeath: 2005, biography-en: Born in Nicosia. Studied painting at the Higher School of Fine Arts and the Free Institute of Fine Arts in Athens. Pursued post-graduate studies at the Thomson Foundation T.V. College in Glasgow. Has exhibited in Cyprus and abroad (India, France, Egypt, Italy, Brazil, Greece)., biography-el: Γεννήθηκε στη Λευκωσία. Σπούδασε ζωγραφική στην Ανωτάτη Σχολή Καλών τεχνών και στο Ελεύθερο Σπουδαστήριο Καλών Τεχνών στην Αθήνα. Μετεκπαιδεύτηκε στο Thomson Foundation T.V. College της Γλασκώβης. Εξέθεσε στην Κύπρο και εξωτερικό, όπως Ινδία, Γαλλία, Αίγυπτο, Ιταλία, Βραζιλία, Ελλάδα., id: michael_phinikarides"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Michael Phinikarides"}, "gsx$name-el": {"$t": "Μιχαήλ Φοινικαρίδης"}, "gsx$yearbirth": {"$t": "1940"}, "gsx$yeardeath": {"$t": "2005"}, "gsx$biography-en": {"$t": "Born in Nicosia. Studied painting at the Higher School of Fine Arts and the Free Institute of Fine Arts in Athens. Pursued post-graduate studies at the Thomson Foundation T.V. College in Glasgow. Has exhibited in Cyprus and abroad (India, France, Egypt, Italy, Brazil, Greece)."}, "gsx$biography-el": {"$t": "Γεννήθηκε στη Λευκωσία. Σπούδασε ζωγραφική στην Ανωτάτη Σχολή Καλών τεχνών και στο Ελεύθερο Σπουδαστήριο Καλών Τεχνών στην Αθήνα. Μετεκπαιδεύτηκε στο Thomson Foundation T.V. College της Γλασκώβης. Εξέθεσε στην Κύπρο και εξωτερικό, όπως Ινδία, Γαλλία, Αίγυπτο, Ιταλία, Βραζιλία, Ελλάδα."}, "gsx$id": {"$t": "michael_phinikarides"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-30T11:59:58.779Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Andreas Savvides"}, "content": {"type": "text", "$t": "name-el: Ανδρέας Σαββίδης, yearbirth: 1930, yeardeath: 2016, biography-en: Born in Kyrenia. Studied sculpture at the Chelsea School of Art in London.Has exhibited his work in Cyprus and abroad (Egypt, England, Scotland, Yugoslavia, Spain, Hungary, Brazil)., biography-el: Γεννήθηκε στην Κερύνεια. Σπούδασε γλυπτική στο Chelsea School of Art στο Λονδίνο. Εξέθεσε έργα του στην Κύπρο και στο εξωτερικό όπως Αίγυπτο, Αγγλία, Σκωτία, Γιουγκοσλαβία, Ισπανία, Ουγγαρία, Βραζιλία., id: andreas_savvides"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Andreas Savvides"}, "gsx$name-el": {"$t": "Ανδρέας Σαββίδης"}, "gsx$yearbirth": {"$t": "1930"}, "gsx$yeardeath": {"$t": "2016"}, "gsx$biography-en": {"$t": "Born in Kyrenia. Studied sculpture at the Chelsea School of Art in London.Has exhibited his work in Cyprus and abroad (Egypt, England, Scotland, Yugoslavia, Spain, Hungary, Brazil)."}, "gsx$biography-el": {"$t": "Γεννήθηκε στην Κερύνεια. Σπούδασε γλυπτική στο Chelsea School of Art στο Λονδίνο. Εξέθεσε έργα του στην Κύπρο και στο εξωτερικό όπως Αίγυπτο, Αγγλία, Σκωτία, Γιουγκοσλαβία, Ισπανία, Ουγγαρία, Βραζιλία."}, "gsx$id": {"$t": "andreas_savvides"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-30T11:59:58.779Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "George Sfikas"}, "content": {"type": "text", "$t": "name-el: Γιώργος Σφήκας, yearbirth: 1943, biography-en: Born in Nicosia. Studied art at the Camberwell School of Art, St. Martin's School of Art and the Institute of Education London University. Has exhibited his work in Cyprus and abroad (England. Greece, Lebanon, Egypt, oland, Yugoslavia, India, France, Spain, Turkey, Italy)., biography-el: Γεννήθηκε στη Λευκωσία. Σπούδασε τέχνη στο Camberwell School of Art, στο Saint Martin's School of Art και στο Institute of Education του Πανεπιστημίου του Λονδίνου. Εξέθεσε στην Κύπρο και στο εξωτερικό, όπως Αγγλία, Ελλάδα, Λίβανο, Αίγυπτο, Πολωνία, Γιουγκοσλαβία, Ινδία, Γαλλία, Ισπανία, Τουρκία, Ιταλία., id: george_sfikas"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "George Sfikas"}, "gsx$name-el": {"$t": "Γιώργος Σφήκας"}, "gsx$yearbirth": {"$t": "1943"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography-en": {"$t": "Born in Nicosia. Studied art at the Camberwell School of Art, St. Martin's School of Art and the Institute of Education London University. Has exhibited his work in Cyprus and abroad (England. Greece, Lebanon, Egypt, oland, Yugoslavia, India, France, Spain, Turkey, Italy)."}, "gsx$biography-el": {"$t": "Γεννήθηκε στη Λευκωσία. Σπούδασε τέχνη στο Camberwell School of Art, στο Saint Martin's School of Art και στο Institute of Education του Πανεπιστημίου του Λονδίνου. Εξέθεσε στην Κύπρο και στο εξωτερικό, όπως Αγγλία, Ελλάδα, Λίβανο, Αίγυπτο, Πολωνία, Γιουγκοσλαβία, Ινδία, Γαλλία, Ισπανία, Τουρκία, Ιταλία."}, "gsx$id": {"$t": "george_sfikas"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-30T11:59:58.779Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Stelios Votsis"}, "content": {"type": "text", "$t": "name-el: Στέλιος Βότσης, yearbirth: 1929, yeardeath: 2012, biography-en: Born in Larnaca. Studied at St. Martin's School of Art, Sir John Cass College, the Royal Academy of Art and the Slade School of Art. Has exhibited his work in Cyprus and abroad (Greece, U.S.A., England, Yugoslavia, Switzerland, Poland, Norway, Spain, France, Belgium)., biography-el: Γεννήθηκε στη Λάρνακα. Σπούδασε στο St. Martin's School of Art, to Sir John Cass College, to Royal Academy of Art και το Slade School of Arts. Εξέθεσε έργα του στην Κύπρο και στο εξωτερικό, όπως Ελλάδα, Η.Π.Α., Αγγλία, Γιουγκοσλαβία, Ελβετία, Πολωνία, Νορβηγία, Ισπανία, Γαλλία, Βέλγιο., id: stelios_votsis"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Stelios Votsis"}, "gsx$name-el": {"$t": "Στέλιος Βότσης"}, "gsx$yearbirth": {"$t": "1929"}, "gsx$yeardeath": {"$t": "2012"}, "gsx$biography-en": {"$t": "Born in Larnaca. Studied at St. Martin's School of Art, Sir John Cass College, the Royal Academy of Art and the Slade School of Art. Has exhibited his work in Cyprus and abroad (Greece, U.S.A., England, Yugoslavia, Switzerland, Poland, Norway, Spain, France, Belgium)."}, "gsx$biography-el": {"$t": "Γεννήθηκε στη Λάρνακα. Σπούδασε στο St. Martin's School of Art, to Sir John Cass College, to Royal Academy of Art και το Slade School of Arts. Εξέθεσε έργα του στην Κύπρο και στο εξωτερικό, όπως Ελλάδα, Η.Π.Α., Αγγλία, Γιουγκοσλαβία, Ελβετία, Πολωνία, Νορβηγία, Ισπανία, Γαλλία, Βέλγιο."}, "gsx$id": {"$t": "stelios_votsis"}}]}}