{"version": "1.0", "encoding": "UTF-8", "feed": {"xmlns": "http://www.w3.org/2005/Atom", "xmlns$openSearch": "http://a9.com/-/spec/opensearchrss/1.0/", "xmlns$gsx": "http://schemas.google.com/spreadsheets/2006/extended", "id": {"$t": ""}, "updated": {"$t": "2020-09-26T10:09:13.289Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Artists_"}, "link": [{"rel": "alternate", "type": "application/atom+xml", "href": ""}, {"rel": "http://schemas.google.com/g/2005#feed", "type": "application/atom+xml", "href": ""}, {"rel": "http://schemas.google.com/g/2005#post", "type": "application/atom+xml", "href": ""}, {"rel": "self", "type": "application/atom+xml", "href": ""}], "author": [{"name": {"$t": ""}, "email": {"$t": "gmail.com"}}], "openSearch$totalResults": {"$t": "11"}, "openSearch$startIndex": {"$t": "1"}, "entry": [{"id": {"$t": ""}, "updated": {"$t": "2020-09-26T10:09:13.289Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Andreas Ladommatos"}, "content": {"type": "text", "$t": "name-el: Ανδρέας Λαδόμματος, yearbirth: 1940, biography-en: Andreas Ladommatos was born in Nicosia, 1940, and showed his talent in painting and drawing when he was a child and during his schooling at the Pancyprian Gymnasium, secondary school, where he was taught painting and drawing by the famous Cypriot artist Telemachos Kanthos. \n\nAfter he left school, Ladommatos studied art at Camberwell School of Art and Crafts in London during the years 1960 - 1964 under the guidance of renowned artists like Frank Auerbach, Peter Uglow, Robert Medley.\n\nAndreas Ladommatos’ art is found in important private and public collections in Cyprus, the Presidential Palace, most Ministers’ Offices, The State Gallery, Municipal Collections, the Collection of Makarios III Institution etc.\n\nThe University of Cyprus owns a comprehensive collection of his work, donated by the artist and his wife Mary.\n\nHis work is to be found also in private collections in numerous countries in Europe, the United States and Australia., biography-el: Ο Ανδρέας Λαδόμματος γεννήθηκε στη Λευκωσία το 1940 και έδειξε το ταλέντο του στη ζωγραφική και το σχέδιο όταν ήταν παιδί και κατά τη διάρκεια της σχολικής του εκπαίδευσης στο Παγκύπριο Γυμνάσιο, όπου διδάχτηκε ζωγραφική και σχέδιο από τον διάσημο Κύπριο καλλιτέχνη Τηλέμαχο Κάνθο.\n\nΑφού έφυγε από το σχολείο, ο Ladommatos σπούδασε τέχνη στο Camberwell School of Art and Crafts στο Λονδίνο κατά τα έτη 1960 - 1964 υπό την καθοδήγηση διάσημων καλλιτεχνών όπως ο Frank Auerbach, ο Peter Uglow, ο Robert Medley.\n\nΗ τέχνη του Ανδρέα Λαδομάτου βρίσκεται σε σημαντικές ιδιωτικές και δημόσιες συλλογές στην Κύπρο, στο Προεδρικό Μέγαρο, στα περισσότερα γραφεία των Υπουργών, στην Κρατική Πινακοθήκη, στις Δημοτικές Συλλογές, στη Συλλογή του Ιδρύματος Μακάριος ΙΙΙ κ.λπ.\n\nΤο Πανεπιστήμιο Κύπρου διαθέτει μια ολοκληρωμένη συλλογή του έργου του, δωρεά από τον καλλιτέχνη και τη σύζυγό του Μαίρη.\n\nΤο έργο του βρίσκεται επίσης σε ιδιωτικές συλλογές σε πολλές χώρες της Ευρώπης, των Ηνωμένων Πολιτειών και της Αυστραλίας., id: andreas_ladommatos"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Andreas Ladommatos"}, "gsx$name-el": {"$t": "Ανδρέας Λαδόμματος"}, "gsx$yearbirth": {"$t": "1940"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography-en": {"$t": "Andreas Ladommatos was born in Nicosia, 1940, and showed his talent in painting and drawing when he was a child and during his schooling at the Pancyprian Gymnasium, secondary school, where he was taught painting and drawing by the famous Cypriot artist Telemachos Kanthos. \n\nAfter he left school, Ladommatos studied art at Camberwell School of Art and Crafts in London during the years 1960 - 1964 under the guidance of renowned artists like Frank Auerbach, Peter Uglow, Robert Medley.\n\nAndreas Ladommatos’ art is found in important private and public collections in Cyprus, the Presidential Palace, most Ministers’ Offices, The State Gallery, Municipal Collections, the Collection of Makarios III Institution etc.\n\nThe University of Cyprus owns a comprehensive collection of his work, donated by the artist and his wife Mary.\n\nHis work is to be found also in private collections in numerous countries in Europe, the United States and Australia."}, "gsx$biography-el": {"$t": "Ο Ανδρέας Λαδόμματος γεννήθηκε στη Λευκωσία το 1940 και έδειξε το ταλέντο του στη ζωγραφική και το σχέδιο όταν ήταν παιδί και κατά τη διάρκεια της σχολικής του εκπαίδευσης στο Παγκύπριο Γυμνάσιο, όπου διδάχτηκε ζωγραφική και σχέδιο από τον διάσημο Κύπριο καλλιτέχνη Τηλέμαχο Κάνθο.\n\nΑφού έφυγε από το σχολείο, ο Ladommatos σπούδασε τέχνη στο Camberwell School of Art and Crafts στο Λονδίνο κατά τα έτη 1960 - 1964 υπό την καθοδήγηση διάσημων καλλιτεχνών όπως ο Frank Auerbach, ο Peter Uglow, ο Robert Medley.\n\nΗ τέχνη του Ανδρέα Λαδομάτου βρίσκεται σε σημαντικές ιδιωτικές και δημόσιες συλλογές στην Κύπρο, στο Προεδρικό Μέγαρο, στα περισσότερα γραφεία των Υπουργών, στην Κρατική Πινακοθήκη, στις Δημοτικές Συλλογές, στη Συλλογή του Ιδρύματος Μακάριος ΙΙΙ κ.λπ.\n\nΤο Πανεπιστήμιο Κύπρου διαθέτει μια ολοκληρωμένη συλλογή του έργου του, δωρεά από τον καλλιτέχνη και τη σύζυγό του Μαίρη.\n\nΤο έργο του βρίσκεται επίσης σε ιδιωτικές συλλογές σε πολλές χώρες της Ευρώπης, των Ηνωμένων Πολιτειών και της Αυστραλίας."}, "gsx$id": {"$t": "andreas_ladommatos"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-26T10:09:13.289Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Andis Bargilly"}, "content": {"type": "text", "$t": "name-el: Άντης Παρτζίλης, yearbirth: 1947, biography-en: Painter, set designer. He was born in 1947 in the city of Famagusta. After graduating from the Famagusta High School, he studied stage design and costume design at the Prague Academy of Applied Arts (VSUP) and the Prague Academy of Musical Arts (DAMU). United States, United Kingdom, Germany and elsewhere., biography-el: Ζωγράφος, σκηνογράφος. Γεννήθηκε το 1947 στην πόλη της Αμμοχώστου. Μετά την αποφοίτησή του από το Α' Γυμνάσιο Αμμοχώστου σπούδασε σκηνογραφία-ενδυματολογία θεάτρου στην Ανωτάτη Ακαδημία Εφαρμοσμένων Τεχνών Πράγας (VSUP) και στην Ανωτάτη Θεατρική Ακαδημία Μουσικών Τεχνών Πράγας (DAMU).Παρακολούθησε επίσης σεμινάρια και άλλα προγράμματα σχετικά με τις Τέχνες και το Θέατρο στις Ηνωμένες Πολιτείες, το Ηνωμένο Βασίλειο, τη Γερμανία και αλλού., id: andis_bargilly"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Andis Bargilly"}, "gsx$name-el": {"$t": "Άντης Παρτζίλης"}, "gsx$yearbirth": {"$t": "1947"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography-en": {"$t": "Painter, set designer. He was born in 1947 in the city of Famagusta. After graduating from the Famagusta High School, he studied stage design and costume design at the Prague Academy of Applied Arts (VSUP) and the Prague Academy of Musical Arts (DAMU). United States, United Kingdom, Germany and elsewhere."}, "gsx$biography-el": {"$t": "Ζωγράφος, σκηνογράφος. Γεννήθηκε το 1947 στην πόλη της Αμμοχώστου. Μετά την αποφοίτησή του από το Α' Γυμνάσιο Αμμοχώστου σπούδασε σκηνογραφία-ενδυματολογία θεάτρου στην Ανωτάτη Ακαδημία Εφαρμοσμένων Τεχνών Πράγας (VSUP) και στην Ανωτάτη Θεατρική Ακαδημία Μουσικών Τεχνών Πράγας (DAMU).Παρακολούθησε επίσης σεμινάρια και άλλα προγράμματα σχετικά με τις Τέχνες και το Θέατρο στις Ηνωμένες Πολιτείες, το Ηνωμένο Βασίλειο, τη Γερμανία και αλλού."}, "gsx$id": {"$t": "andis_bargilly"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-26T10:09:13.289Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Andreas Chrysochos"}, "content": {"type": "text", "$t": "name-el: Ανδρέας Χρυσοχός, yearbirth: 1929, biography-en: Andreas Chrysochos was born in 1929 in the village of Milia in the province of Famagusta. He took the surname Chrysochos from his father, who practiced the profession of goldsmith. to follow the path of the visual arts. \n\nHe studied at the Pancyprian High School, having Adamantios Diamantis as his teacher. This was followed by his studies at the Teaching College of Morphou. His award at a Commonwealth Watercolor Competition in London gave him the opportunity to attend the School of Art Goldsmiths ’College (1952-54), with a scholarship from the English Government. He returned to Cyprus and worked as an art course organizer for three years., biography-el: O Ανδρέας Χρυσοχός γεννήθηκε το 1929 στο χωριό Μηλιά της επαρχίας Αμμοχώστου. Το επίθετο Χρυσοχός το πήρε από τον πατέρα του που εξασκούσε το επάγγελμα του χρυσοχόου. Τα τεχνουργήματα που έφτιαχνε ο πατέρας του και οι βυζαντινές εικόνες που έβλεπε στην εκκλησία του χωριού του τον επηρέασαν να ακολουθήσει τον δρόμο των εικαστικών τεχνών.\n\nΦοίτησε στο Παγκύπριο Γυμνάσιο, έχοντας ως δάσκαλο τον Αδαμάντιο Διαμαντή. Ακολούθησε η φοίτησή του στο Διδασκαλικό Κολλέγιο Μόρφου. Η βράβευσή του σε ένα κοινοπολιτειακό διαγωνισμό υδατογραφίας στο Λονδίνο του πρόσφερε την ευκαιρία να φοιτήσει στο School of Art Goldsmiths’ College (1952-54), με υποτροφία της αγγλικής κυβέρνησης. Επέστρεψε στην Κύπρο και εργάστηκε ως οργανωτής του μαθήματος της τέχνης για τρία χρόνια., id: andreas_chrysochos"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Andreas Chrysochos"}, "gsx$name-el": {"$t": "Ανδρέας Χρυσοχός"}, "gsx$yearbirth": {"$t": "1929"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography-en": {"$t": "Andreas Chrysochos was born in 1929 in the village of Milia in the province of Famagusta. He took the surname Chrysochos from his father, who practiced the profession of goldsmith. to follow the path of the visual arts. \n\nHe studied at the Pancyprian High School, having Adamantios Diamantis as his teacher. This was followed by his studies at the Teaching College of Morphou. His award at a Commonwealth Watercolor Competition in London gave him the opportunity to attend the School of Art Goldsmiths ’College (1952-54), with a scholarship from the English Government. He returned to Cyprus and worked as an art course organizer for three years."}, "gsx$biography-el": {"$t": "O Ανδρέας Χρυσοχός γεννήθηκε το 1929 στο χωριό Μηλιά της επαρχίας Αμμοχώστου. Το επίθετο Χρυσοχός το πήρε από τον πατέρα του που εξασκούσε το επάγγελμα του χρυσοχόου. Τα τεχνουργήματα που έφτιαχνε ο πατέρας του και οι βυζαντινές εικόνες που έβλεπε στην εκκλησία του χωριού του τον επηρέασαν να ακολουθήσει τον δρόμο των εικαστικών τεχνών.\n\nΦοίτησε στο Παγκύπριο Γυμνάσιο, έχοντας ως δάσκαλο τον Αδαμάντιο Διαμαντή. Ακολούθησε η φοίτησή του στο Διδασκαλικό Κολλέγιο Μόρφου. Η βράβευσή του σε ένα κοινοπολιτειακό διαγωνισμό υδατογραφίας στο Λονδίνο του πρόσφερε την ευκαιρία να φοιτήσει στο School of Art Goldsmiths’ College (1952-54), με υποτροφία της αγγλικής κυβέρνησης. Επέστρεψε στην Κύπρο και εργάστηκε ως οργανωτής του μαθήματος της τέχνης για τρία χρόνια."}, "gsx$id": {"$t": "andreas_chrysochos"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-26T10:09:13.289Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Vera Hadjida"}, "content": {"type": "text", "$t": "name-el: Βέρα Χατζηδά, yearbirth: 1936, yeardeath: 2012, biography-en: He studied painting and interior design at the Kingston School of Art in London (1955 - 1959). In 1959 she returned to Cyprus and began working, in parallel with her painting career, in secondary schools. From 1983 to 1988 he taught at the Pedagogical Academy. She has presented her work in solo and group exhibitions in Cyprus and abroad, Paris, Biennale of Young Artists of the Mediterranean, Boston, Exhibition of Cypriot Painters, Triennial of India, Biennale of Sao Paulo, London, Edinburgh, Commonwealth, Institute of Art, 10 etc. Her works are in the Cyprus Gallery of Contemporary Cypriot Art, in the embassies of Cyprus in Washington, New York, Moscow, in the Bank of Greece and in private collections in Cyprus and abroad., biography-el: Σπούδασε ζωγραφική και εσωτερική διακόσμηση στο  Kingston School of Art  στο Λονδίνο (1955 - 1959). Το 1959 επέστρεψε στη Κύπρο και άρχισε να εργάζεται, παράλληλα με την ενασχόληση της στη ζωγραφική, σε σχολεία Μέσης Εκπαίδευσης. Από το 1983 μέχρι το 1988 δίδαξε στη Παιδαγογική Ακαδημία. Έχει παρουσιάσει το έργο της σε ατομικές και ομαδικές εκθέσεις στη Κύπρο και στο εξωτερικό, Παρίσι, Μπιενάλε Νέων καλλιτεχνών της Μεσογείου, Βοστώνη, Έκθεση Κυπρίων Ζωγράφων, Τριενάλε Ινδιών, Μπιενάλε Σαο Πάολο, Λονδίνο, Εδιμβούργο, Ινστιτούτο Κοινοπολιτείας, Αθήνα, Ομαδική 10 Κυπρίων Καλλιτεχνών κ.α. Έργα της βρίσκονται στην Κυπριακή Πινακοθήκη Σύγχρονης Κυπριακής Τέχνης, σε πρεσβείες της Κύπρου στην Ουάσιγκτον, Νέα Υόρκη, Μόσχα, στην Τράπεζα της Ελλάδος και σε ιδιοτικές συλλογές στη Κύπρο και στο εξωτερικό., id: vera_hadjida"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Vera Hadjida"}, "gsx$name-el": {"$t": "Βέρα Χατζηδά"}, "gsx$yearbirth": {"$t": "1936"}, "gsx$yeardeath": {"$t": "2012"}, "gsx$biography-en": {"$t": "He studied painting and interior design at the Kingston School of Art in London (1955 - 1959). In 1959 she returned to Cyprus and began working, in parallel with her painting career, in secondary schools. From 1983 to 1988 he taught at the Pedagogical Academy. She has presented her work in solo and group exhibitions in Cyprus and abroad, Paris, Biennale of Young Artists of the Mediterranean, Boston, Exhibition of Cypriot Painters, Triennial of India, Biennale of Sao Paulo, London, Edinburgh, Commonwealth, Institute of Art, 10 etc. Her works are in the Cyprus Gallery of Contemporary Cypriot Art, in the embassies of Cyprus in Washington, New York, Moscow, in the Bank of Greece and in private collections in Cyprus and abroad."}, "gsx$biography-el": {"$t": "Σπούδασε ζωγραφική και εσωτερική διακόσμηση στο  Kingston School of Art  στο Λονδίνο (1955 - 1959). Το 1959 επέστρεψε στη Κύπρο και άρχισε να εργάζεται, παράλληλα με την ενασχόληση της στη ζωγραφική, σε σχολεία Μέσης Εκπαίδευσης. Από το 1983 μέχρι το 1988 δίδαξε στη Παιδαγογική Ακαδημία. Έχει παρουσιάσει το έργο της σε ατομικές και ομαδικές εκθέσεις στη Κύπρο και στο εξωτερικό, Παρίσι, Μπιενάλε Νέων καλλιτεχνών της Μεσογείου, Βοστώνη, Έκθεση Κυπρίων Ζωγράφων, Τριενάλε Ινδιών, Μπιενάλε Σαο Πάολο, Λονδίνο, Εδιμβούργο, Ινστιτούτο Κοινοπολιτείας, Αθήνα, Ομαδική 10 Κυπρίων Καλλιτεχνών κ.α. Έργα της βρίσκονται στην Κυπριακή Πινακοθήκη Σύγχρονης Κυπριακής Τέχνης, σε πρεσβείες της Κύπρου στην Ουάσιγκτον, Νέα Υόρκη, Μόσχα, στην Τράπεζα της Ελλάδος και σε ιδιοτικές συλλογές στη Κύπρο και στο εξωτερικό."}, "gsx$id": {"$t": "vera_hadjida"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-26T10:09:13.289Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Nicos Kouroussis"}, "content": {"type": "text", "$t": "name-el: Νίκος Κουρούσιης, yearbirth: 1937, biography-en: He was born in Mitsero in 1937. He studied at the St. Martins and Hornsey College of Art in London. He has presented his work in many solo and group exhibitions in Cyprus, Greece, the United States and throughout Europe. He represented Cyprus tice at the Venice Biennale (1972 and 1990)., biography-el: Γεννήθηκε στο Μιτσερό το 1937. Σπούδασε στο St. Martins και Hornsey College of Art στο Λονδίνο. Έχει παρουσιάσει το έργο του σε πολλές ατομικές και ομαδικές εκθέσεις στην Κύπρο, την Ελλάδα, τις Ηνωμένες Πολιτείες και σε όλη την Ευρώπη. Εκπροσώπησε τα κυπριακά στο Μπιενάλε της Βενετίας (1972 και 1990)., id: nicos_kouroussis"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Nicos Kouroussis"}, "gsx$name-el": {"$t": "Νίκος Κουρούσιης"}, "gsx$yearbirth": {"$t": "1937"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography-en": {"$t": "He was born in Mitsero in 1937. He studied at the St. Martins and Hornsey College of Art in London. He has presented his work in many solo and group exhibitions in Cyprus, Greece, the United States and throughout Europe. He represented Cyprus tice at the Venice Biennale (1972 and 1990)."}, "gsx$biography-el": {"$t": "Γεννήθηκε στο Μιτσερό το 1937. Σπούδασε στο St. Martins και Hornsey College of Art στο Λονδίνο. Έχει παρουσιάσει το έργο του σε πολλές ατομικές και ομαδικές εκθέσεις στην Κύπρο, την Ελλάδα, τις Ηνωμένες Πολιτείες και σε όλη την Ευρώπη. Εκπροσώπησε τα κυπριακά στο Μπιενάλε της Βενετίας (1972 και 1990)."}, "gsx$id": {"$t": "nicos_kouroussis"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-26T10:09:13.289Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "George Kyriakou"}, "content": {"type": "text", "$t": "name-el: Γιώργος Κυριάκου, yearbirth: 1940, biography-en: George Kyriacou was an elementary school teacher for two years before going on to study sculpture at Chelsea School of Art in London from 1961 to 1964. From the time he graduated until 1969 he worked as a secondary school art teacher. In 1969 he was appointed head of the arts sector of the Cultural Services of the Ministry of Education. Later, in 1972, he moved to Paris to study museology at La Sorbonne on a scholarship from The French government. He then studied at the Central London Polytechnic (1976-1977), where he obtained a Diploma in Arts and Leisure Administration. He has been a pioneer of contemporary sculpture in Cyprus and he has worked extensively in monumental sculpture.\n\nKyriacou’s habit of rescuing items, which have had another life, is integral to his process of working. He likes to explore and exploit the past life of abandoned objects, which have been discarded as useless and to give them a new life while still retaining a sense of the old., biography-el: Ο Γιώργος Κυριάκου ήταν δάσκαλος δημοτικού σχολείου για δύο χρόνια πριν συνεχίσει να σπουδάζει γλυπτική στο Chelsea School of Art στο Λονδίνο από το 1961 έως το 1964. Από τη στιγμή που αποφοίτησε μέχρι το 1969 εργάστηκε ως καθηγητής τέχνης δευτεροβάθμιας εκπαίδευσης. Το 1969 διορίστηκε επικεφαλής του τομέα των τεχνών των Πολιτιστικών Υπηρεσιών του Υπουργείου Παιδείας. Αργότερα, το 1972, μετακόμισε στο Παρίσι για να σπουδάσει μουσειολογία στο La Sorbonne με υποτροφία από τη γαλλική κυβέρνηση. Στη συνέχεια σπούδασε στο Central London Polytechnic (1976-1977 , όπου απέκτησε δίπλωμα διοίκησης τεχνών και αναψυχής. Υπήρξε πρωτοπόρος της σύγχρονης γλυπτικής στην Κύπρο και έχει εργαστεί εκτενώς στη μνημειακή γλυπτική. Η συνήθεια του Κυριάκου να σώζει αντικείμενα, τα οποία είχαν μια άλλη ζωή, είναι αναπόσπαστο μέρος της διαδικασίας εργασίας του. Του αρέσει να εξερευνά και να εκμεταλλεύεται την προηγούμενη ζωή των εγκαταλελειμμένων αντικειμένων, τα οποία έχουν απορριφθεί ως άχρηστα και να τους δώσει μια νέα ζωή, διατηρώντας παράλληλα την αίσθηση του παλιού., id: george_kyriakou"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "George Kyriakou"}, "gsx$name-el": {"$t": "Γιώργος Κυριάκου"}, "gsx$yearbirth": {"$t": "1940"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography-en": {"$t": "George Kyriacou was an elementary school teacher for two years before going on to study sculpture at Chelsea School of Art in London from 1961 to 1964. From the time he graduated until 1969 he worked as a secondary school art teacher. In 1969 he was appointed head of the arts sector of the Cultural Services of the Ministry of Education. Later, in 1972, he moved to Paris to study museology at La Sorbonne on a scholarship from The French government. He then studied at the Central London Polytechnic (1976-1977), where he obtained a Diploma in Arts and Leisure Administration. He has been a pioneer of contemporary sculpture in Cyprus and he has worked extensively in monumental sculpture.\n\nKyriacou’s habit of rescuing items, which have had another life, is integral to his process of working. He likes to explore and exploit the past life of abandoned objects, which have been discarded as useless and to give them a new life while still retaining a sense of the old."}, "gsx$biography-el": {"$t": "Ο Γιώργος Κυριάκου ήταν δάσκαλος δημοτικού σχολείου για δύο χρόνια πριν συνεχίσει να σπουδάζει γλυπτική στο Chelsea School of Art στο Λονδίνο από το 1961 έως το 1964. Από τη στιγμή που αποφοίτησε μέχρι το 1969 εργάστηκε ως καθηγητής τέχνης δευτεροβάθμιας εκπαίδευσης. Το 1969 διορίστηκε επικεφαλής του τομέα των τεχνών των Πολιτιστικών Υπηρεσιών του Υπουργείου Παιδείας. Αργότερα, το 1972, μετακόμισε στο Παρίσι για να σπουδάσει μουσειολογία στο La Sorbonne με υποτροφία από τη γαλλική κυβέρνηση. Στη συνέχεια σπούδασε στο Central London Polytechnic (1976-1977 , όπου απέκτησε δίπλωμα διοίκησης τεχνών και αναψυχής. Υπήρξε πρωτοπόρος της σύγχρονης γλυπτικής στην Κύπρο και έχει εργαστεί εκτενώς στη μνημειακή γλυπτική. Η συνήθεια του Κυριάκου να σώζει αντικείμενα, τα οποία είχαν μια άλλη ζωή, είναι αναπόσπαστο μέρος της διαδικασίας εργασίας του. Του αρέσει να εξερευνά και να εκμεταλλεύεται την προηγούμενη ζωή των εγκαταλελειμμένων αντικειμένων, τα οποία έχουν απορριφθεί ως άχρηστα και να τους δώσει μια νέα ζωή, διατηρώντας παράλληλα την αίσθηση του παλιού."}, "gsx$id": {"$t": "george_kyriakou"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-26T10:09:13.289Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Angelos Makrides"}, "content": {"type": "text", "$t": "name-el: Άγγελος Μακρίδης, yearbirth: 1940, biography-en: He studied sculpture at the Athens School of Fine Arts (1961-1967) with teacher Thanasis Apartis. He worked in Paris (1967-1969), Nicosia (1969-1974) and Athens (1974-1986). Since 1986 he lives and works in Cyprus., biography-el: Σπούδασε γλυπτική στην Ανωτάτη Σχολή Καλών Τεχνών Αθηνών (1961-1967) με δάσκαλο το Θανάση Απάρτη. Δούλεψε στο Παρίσι (1967-1969), στη Λευκωσία (1969-1974) και στην Αθήνα (1974-1986). Από το 1986 ζει και εργάζεται στην Κύπρο., id: angelos_makrides"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Angelos Makrides"}, "gsx$name-el": {"$t": "Άγγελος Μακρίδης"}, "gsx$yearbirth": {"$t": "1940"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography-en": {"$t": "He studied sculpture at the Athens School of Fine Arts (1961-1967) with teacher Thanasis Apartis. He worked in Paris (1967-1969), Nicosia (1969-1974) and Athens (1974-1986). Since 1986 he lives and works in Cyprus."}, "gsx$biography-el": {"$t": "Σπούδασε γλυπτική στην Ανωτάτη Σχολή Καλών Τεχνών Αθηνών (1961-1967) με δάσκαλο το Θανάση Απάρτη. Δούλεψε στο Παρίσι (1967-1969), στη Λευκωσία (1969-1974) και στην Αθήνα (1974-1986). Από το 1986 ζει και εργάζεται στην Κύπρο."}, "gsx$id": {"$t": "angelos_makrides"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-26T10:09:13.289Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Michael Phinikarides"}, "content": {"type": "text", "$t": "name-el: Μίκης Φοινικαρίδης, yearbirth: 1940, yeardeath: 2005, biography-en: He was born in Nicosia in 1940 and died in Athens in 2005. He studied at ASKT. He taught in Cypriot education and worked as a graphic designer in Cypriot and mainly in Greek television. His work is distinguished for its Cypriot-centric character in both color and subject matter. In recent years he has dealt with the female figure, who portrayed her with an expression and a color of Cypriot archetype., biography-el: Γεννήθηκε στη Λευκωσία το 1940 και πέθανε στην Αθήνα το 2005. Σπούδασε στην ΑΣΚΤ. Δίδαξε στην κυπριακή εκπαίδευση και δούλεψε ως γραφίστας στην κυπριακή και κυρίως στην ελληνική τηλεόραση. Το έργο του διακρίνεται για τον κυπροκεντρικό του χαρακτήρα τόσο στο χρώμα όσο και στη θεματογραφία. Τα τελευταία χρόνια ασχολείτο με τη γυναικεία μορφή, που την απέδιδε με μια έκφραση κι ένα χρώμα κυπριακού αρχέτυπου., id: michael_phinikarides"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Michael Phinikarides"}, "gsx$name-el": {"$t": "Μίκης Φοινικαρίδης"}, "gsx$yearbirth": {"$t": "1940"}, "gsx$yeardeath": {"$t": "2005"}, "gsx$biography-en": {"$t": "He was born in Nicosia in 1940 and died in Athens in 2005. He studied at ASKT. He taught in Cypriot education and worked as a graphic designer in Cypriot and mainly in Greek television. His work is distinguished for its Cypriot-centric character in both color and subject matter. In recent years he has dealt with the female figure, who portrayed her with an expression and a color of Cypriot archetype."}, "gsx$biography-el": {"$t": "Γεννήθηκε στη Λευκωσία το 1940 και πέθανε στην Αθήνα το 2005. Σπούδασε στην ΑΣΚΤ. Δίδαξε στην κυπριακή εκπαίδευση και δούλεψε ως γραφίστας στην κυπριακή και κυρίως στην ελληνική τηλεόραση. Το έργο του διακρίνεται για τον κυπροκεντρικό του χαρακτήρα τόσο στο χρώμα όσο και στη θεματογραφία. Τα τελευταία χρόνια ασχολείτο με τη γυναικεία μορφή, που την απέδιδε με μια έκφραση κι ένα χρώμα κυπριακού αρχέτυπου."}, "gsx$id": {"$t": "michael_phinikarides"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-26T10:09:13.289Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Andreas Savvides"}, "content": {"type": "text", "$t": "name-el: Ανδρέας Σαββίδης, yearbirth: 1930, yeardeath: 2016, biography-en: Andreas Savvidis was born in Kyrenia in 1930. He graduated from the Pancyprian High School, with Adamantios Diamantis as his art teacher. In 1950-52 he studied at the Teachers' College of Morphou, under the tutelage of the Turkish Cypriot Jivet Hussein. He worked as a teacher in the model Urban School of Agios Antonios. There he had the opportunity to meet Costas Oikonomou and Andreas Papadopoulos. They shared the same perceptions of art in education. At the urging of their inspector Theodotos Kanthos, they applied new for the time educational methods of teaching art., biography-el: Ο Ανδρέας Σαββίδης γεννήθηκε στην Κερύνεια το 1930. Αποφοίτησε από το Παγκύπριο Γυμνάσιο, με δάσκαλο στην τέχνη τον Αδαμάντιο Διαμαντή. Το 1950-52 φοίτησε στο Διδασκαλικό Κολλέγιο Μόρφου, με δάσκαλο τον Τουρκοκύπριο Τζιεβτέτ Χουσεΐν. Εργάστηκε ως δάσκαλος στην πρότυπη Αστική Σχολή Αγίου Αντωνίου. Εκεί είχε την ευκαιρία να γνωρίσει τον Κώστα Οικονόμου και τον Ανδρέα Παπαδόπουλο. Μοιράζονταν τις ίδιες αντιλήψεις για την τέχνη στην εκπαίδευση. Με την ώθηση του επιθεωρητή τους Θεόδοτου Κάνθου, εφάρμοζαν νέες για την εποχή εκπαιδευτικές μεθόδους διδακτικής της τέχνης., id: andreas_savvides"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Andreas Savvides"}, "gsx$name-el": {"$t": "Ανδρέας Σαββίδης"}, "gsx$yearbirth": {"$t": "1930"}, "gsx$yeardeath": {"$t": "2016"}, "gsx$biography-en": {"$t": "Andreas Savvidis was born in Kyrenia in 1930. He graduated from the Pancyprian High School, with Adamantios Diamantis as his art teacher. In 1950-52 he studied at the Teachers' College of Morphou, under the tutelage of the Turkish Cypriot Jivet Hussein. He worked as a teacher in the model Urban School of Agios Antonios. There he had the opportunity to meet Costas Oikonomou and Andreas Papadopoulos. They shared the same perceptions of art in education. At the urging of their inspector Theodotos Kanthos, they applied new for the time educational methods of teaching art."}, "gsx$biography-el": {"$t": "Ο Ανδρέας Σαββίδης γεννήθηκε στην Κερύνεια το 1930. Αποφοίτησε από το Παγκύπριο Γυμνάσιο, με δάσκαλο στην τέχνη τον Αδαμάντιο Διαμαντή. Το 1950-52 φοίτησε στο Διδασκαλικό Κολλέγιο Μόρφου, με δάσκαλο τον Τουρκοκύπριο Τζιεβτέτ Χουσεΐν. Εργάστηκε ως δάσκαλος στην πρότυπη Αστική Σχολή Αγίου Αντωνίου. Εκεί είχε την ευκαιρία να γνωρίσει τον Κώστα Οικονόμου και τον Ανδρέα Παπαδόπουλο. Μοιράζονταν τις ίδιες αντιλήψεις για την τέχνη στην εκπαίδευση. Με την ώθηση του επιθεωρητή τους Θεόδοτου Κάνθου, εφάρμοζαν νέες για την εποχή εκπαιδευτικές μεθόδους διδακτικής της τέχνης."}, "gsx$id": {"$t": "andreas_savvides"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-26T10:09:13.289Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "George Sfikas"}, "content": {"type": "text", "$t": "name-el: Γιώργος Σφήκας, yearbirth: 1943, biography-en: George Sfikas (Nicosia) lived and worked in England and Greece. He studied painting and sculpture in London at the Camberwell School of Art, Martin’s School of Art and the Institute of Education of the University of London. He presented his work in Cyprus, London, Paris Biennale and New Delhi Triennale. Sfikas represented Cyprus at the 45th Venice Biennale of Art., biography-el: Ο Γιώργος Σφήκας (Λευκωσία) έζησε και εργάστηκε στην Αγγλία και την Ελλάδα. Σπούδασε ζωγραφική και γλυπτική στο Λονδίνο στο Camberwell School of Art, στη Σχολή Τέχνης του Martin και στο Ινστιτούτο Εκπαίδευσης του Πανεπιστημίου του Λονδίνου. Παρουσίασε το έργο του στην Κύπρο, το Λονδίνο, τη Μπιενάλε του Παρισιού και την Τριενάλε του Νέου Δελχί. Ο Σφίκας εκπροσώπησε την Κύπρο στην 45η Μπιενάλε της Τέχνης της Βενετίας., id: george_sfikas"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "George Sfikas"}, "gsx$name-el": {"$t": "Γιώργος Σφήκας"}, "gsx$yearbirth": {"$t": "1943"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography-en": {"$t": "George Sfikas (Nicosia) lived and worked in England and Greece. He studied painting and sculpture in London at the Camberwell School of Art, Martin’s School of Art and the Institute of Education of the University of London. He presented his work in Cyprus, London, Paris Biennale and New Delhi Triennale. Sfikas represented Cyprus at the 45th Venice Biennale of Art."}, "gsx$biography-el": {"$t": "Ο Γιώργος Σφήκας (Λευκωσία) έζησε και εργάστηκε στην Αγγλία και την Ελλάδα. Σπούδασε ζωγραφική και γλυπτική στο Λονδίνο στο Camberwell School of Art, στη Σχολή Τέχνης του Martin και στο Ινστιτούτο Εκπαίδευσης του Πανεπιστημίου του Λονδίνου. Παρουσίασε το έργο του στην Κύπρο, το Λονδίνο, τη Μπιενάλε του Παρισιού και την Τριενάλε του Νέου Δελχί. Ο Σφίκας εκπροσώπησε την Κύπρο στην 45η Μπιενάλε της Τέχνης της Βενετίας."}, "gsx$id": {"$t": "george_sfikas"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-26T10:09:13.289Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Stelios Votsis"}, "content": {"type": "text", "$t": "name-el: Στέλιος Βότσης, yearbirth: 1929, yeardeath: 2012, biography-en: Stelios Votsis was born in Larnaca in 1929. He studied at the Urban School of Kalogera and then at the Commercial High School of Larnaca, with art teacher Victor Ioannidis. He showed his talent from an early age and Ioannidis, who recognized it, praised him and encouraged him on the path of art. He studied at Saint Martin’s School of Fine Arts in London, Sir John College of Art and the Royal Academy of Arts. He graduated in 1955 from the SLADE School of Art, University College, University of London., biography-el: Ο Στέλιος Βότσης γεννήθηκε στη Λάρνακα το 1929. Φοίτησε στην Αστική Σχολή Καλογερά και στη συνέχεια στο Εμπορικό Λύκειο Λάρνακας, με δάσκαλο τέχνης τον Βίκτωρα Ιωαννίδη. Από νωρίς έδειξε το ταλέντο του και ο Ιωαννίδης που το αναγνώρισε, τον επαινούσε και τον ενεθάρρυνε στον δρόμο της τέχνης. Σπούδασε στις Σχολές Καλών Τεχνών του Λονδίνου Saint Martin’s School of Art, Sir John College of Art και Royal Academy of Arts. Πήρε δίπλωμα το 1955 από το SLADE School of Art, University College, University of London., id: stelios_votsis"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name-en": {"$t": "Stelios Votsis"}, "gsx$name-el": {"$t": "Στέλιος Βότσης"}, "gsx$yearbirth": {"$t": "1929"}, "gsx$yeardeath": {"$t": "2012"}, "gsx$biography-en": {"$t": "Stelios Votsis was born in Larnaca in 1929. He studied at the Urban School of Kalogera and then at the Commercial High School of Larnaca, with art teacher Victor Ioannidis. He showed his talent from an early age and Ioannidis, who recognized it, praised him and encouraged him on the path of art. He studied at Saint Martin’s School of Fine Arts in London, Sir John College of Art and the Royal Academy of Arts. He graduated in 1955 from the SLADE School of Art, University College, University of London."}, "gsx$biography-el": {"$t": "Ο Στέλιος Βότσης γεννήθηκε στη Λάρνακα το 1929. Φοίτησε στην Αστική Σχολή Καλογερά και στη συνέχεια στο Εμπορικό Λύκειο Λάρνακας, με δάσκαλο τέχνης τον Βίκτωρα Ιωαννίδη. Από νωρίς έδειξε το ταλέντο του και ο Ιωαννίδης που το αναγνώρισε, τον επαινούσε και τον ενεθάρρυνε στον δρόμο της τέχνης. Σπούδασε στις Σχολές Καλών Τεχνών του Λονδίνου Saint Martin’s School of Art, Sir John College of Art και Royal Academy of Arts. Πήρε δίπλωμα το 1955 από το SLADE School of Art, University College, University of London."}, "gsx$id": {"$t": "stelios_votsis"}}]}}