{"version": "1.0", "encoding": "UTF-8", "feed": {"xmlns": "http://www.w3.org/2005/Atom", "xmlns$openSearch": "http://a9.com/-/spec/opensearchrss/1.0/", "xmlns$gsx": "http://schemas.google.com/spreadsheets/2006/extended", "id": {"$t": ""}, "updated": {"$t": "2020-09-17T13:12:19.958Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Artists_json"}, "link": [{"rel": "alternate", "type": "application/atom+xml", "href": ""}, {"rel": "http://schemas.google.com/g/2005#feed", "type": "application/atom+xml", "href": ""}, {"rel": "http://schemas.google.com/g/2005#post", "type": "application/atom+xml", "href": ""}, {"rel": "self", "type": "application/atom+xml", "href": ""}], "author": [{"name": {"$t": ""}, "email": {"$t": "gmail.com"}}], "openSearch$totalResults": {"$t": "11"}, "openSearch$startIndex": {"$t": "1"}, "entry": [{"id": {"$t": ""}, "updated": {"$t": "2020-09-17T13:12:19.958Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Andreas Ladommatos"}, "content": {"type": "text", "$t": "yearbirth: 1940, biography: Andreas Ladommatos was born in Nicosia, 1940, and showed his talent in painting and drawing when he was a child and during his schooling at the Pancyprian Gymnasium, secondary school, where he was taught painting and drawing by the famous Cypriot artist Telemachos Kanthos. \n\nAfter he left school, Ladommatos studied art at Camberwell School of Art and Crafts in London during the years 1960 - 1964 under the guidance of renowned artists like Frank Auerbach, Peter Uglow, Robert Medley.\n\nAndreas Ladommatos’ art is found in important private and public collections in Cyprus, the Presidential Palace, most Ministers’ Offices, The State Gallery, Municipal Collections, the Collection of Makarios III Institution etc.\n\nThe University of Cyprus owns a comprehensive collection of his work, donated by the artist and his wife Mary.\n\nHis work is to be found also in private collections in numerous countries in Europe, the United States and Australia., filename: assets/painters/andreas_ladommatos.webp"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name": {"$t": "Andreas Ladommatos"}, "gsx$yearbirth": {"$t": "1940"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography": {"$t": "Andreas Ladommatos was born in Nicosia, 1940, and showed his talent in painting and drawing when he was a child and during his schooling at the Pancyprian Gymnasium, secondary school, where he was taught painting and drawing by the famous Cypriot artist Telemachos Kanthos. \n\nAfter he left school, Ladommatos studied art at Camberwell School of Art and Crafts in London during the years 1960 - 1964 under the guidance of renowned artists like Frank Auerbach, Peter Uglow, Robert Medley.\n\nAndreas Ladommatos’ art is found in important private and public collections in Cyprus, the Presidential Palace, most Ministers’ Offices, The State Gallery, Municipal Collections, the Collection of Makarios III Institution etc.\n\nThe University of Cyprus owns a comprehensive collection of his work, donated by the artist and his wife Mary.\n\nHis work is to be found also in private collections in numerous countries in Europe, the United States and Australia."}, "gsx$filename": {"$t": "assets/painters/andreas_ladommatos.webp"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-17T13:12:19.958Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Andis Bargilly"}, "content": {"type": "text", "$t": "yearbirth: 1947, biography: Ζωγράφος, σκηνογράφος. Γεννήθηκε το 1947 στην πόλη της Αμμοχώστου. Μετά την αποφοίτησή του από το Α' Γυμνάσιο Αμμοχώστου σπούδασε σκηνογραφία-ενδυματολογία θεάτρου στην Ανωτάτη Ακαδημία Εφαρμοσμένων Τεχνών Πράγας (VSUP) και στην Ανωτάτη Θεατρική Ακαδημία Μουσικών Τεχνών Πράγας (DAMU).Παρακολούθησε επίσης σεμινάρια και άλλα προγράμματα σχετικά με τις Τέχνες και το Θέατρο στις Ηνωμένες Πολιτείες, το Ηνωμένο Βασίλειο, τη Γερμανία και αλλού., filename: assets/painters/andis_bargilly.webp"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name": {"$t": "Andis Bargilly"}, "gsx$yearbirth": {"$t": "1947"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography": {"$t": "Ζωγράφος, σκηνογράφος. Γεννήθηκε το 1947 στην πόλη της Αμμοχώστου. Μετά την αποφοίτησή του από το Α' Γυμνάσιο Αμμοχώστου σπούδασε σκηνογραφία-ενδυματολογία θεάτρου στην Ανωτάτη Ακαδημία Εφαρμοσμένων Τεχνών Πράγας (VSUP) και στην Ανωτάτη Θεατρική Ακαδημία Μουσικών Τεχνών Πράγας (DAMU).Παρακολούθησε επίσης σεμινάρια και άλλα προγράμματα σχετικά με τις Τέχνες και το Θέατρο στις Ηνωμένες Πολιτείες, το Ηνωμένο Βασίλειο, τη Γερμανία και αλλού."}, "gsx$filename": {"$t": "assets/painters/andis_bargilly.webp"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-17T13:12:19.958Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Andreas Chrysochos"}, "content": {"type": "text", "$t": "yearbirth: 1929, biography: O Ανδρέας Χρυσοχός γεννήθηκε το 1929 στο χωριό Μηλιά της επαρχίας Αμμοχώστου. Το επίθετο Χρυσοχός το πήρε από τον πατέρα του που εξασκούσε το επάγγελμα του χρυσοχόου. Τα τεχνουργήματα που έφτιαχνε ο πατέρας του και οι βυζαντινές εικόνες που έβλεπε στην εκκλησία του χωριού του τον επηρέασαν να ακολουθήσει τον δρόμο των εικαστικών τεχνών.\n\nΦοίτησε στο Παγκύπριο Γυμνάσιο, έχοντας ως δάσκαλο τον Αδαμάντιο Διαμαντή. Ακολούθησε η φοίτησή του στο Διδασκαλικό Κολλέγιο Μόρφου. Η βράβευσή του σε ένα κοινοπολιτειακό διαγωνισμό υδατογραφίας στο Λονδίνο του πρόσφερε την ευκαιρία να φοιτήσει στο School of Art Goldsmiths’ College (1952-54), με υποτροφία της αγγλικής κυβέρνησης. Επέστρεψε στην Κύπρο και εργάστηκε ως οργανωτής του μαθήματος της τέχνης για τρία χρόνια., filename: assets/painters/andreas_chrysochos.webp"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name": {"$t": "Andreas Chrysochos"}, "gsx$yearbirth": {"$t": "1929"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography": {"$t": "O Ανδρέας Χρυσοχός γεννήθηκε το 1929 στο χωριό Μηλιά της επαρχίας Αμμοχώστου. Το επίθετο Χρυσοχός το πήρε από τον πατέρα του που εξασκούσε το επάγγελμα του χρυσοχόου. Τα τεχνουργήματα που έφτιαχνε ο πατέρας του και οι βυζαντινές εικόνες που έβλεπε στην εκκλησία του χωριού του τον επηρέασαν να ακολουθήσει τον δρόμο των εικαστικών τεχνών.\n\nΦοίτησε στο Παγκύπριο Γυμνάσιο, έχοντας ως δάσκαλο τον Αδαμάντιο Διαμαντή. Ακολούθησε η φοίτησή του στο Διδασκαλικό Κολλέγιο Μόρφου. Η βράβευσή του σε ένα κοινοπολιτειακό διαγωνισμό υδατογραφίας στο Λονδίνο του πρόσφερε την ευκαιρία να φοιτήσει στο School of Art Goldsmiths’ College (1952-54), με υποτροφία της αγγλικής κυβέρνησης. Επέστρεψε στην Κύπρο και εργάστηκε ως οργανωτής του μαθήματος της τέχνης για τρία χρόνια."}, "gsx$filename": {"$t": "assets/painters/andreas_chrysochos.webp"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-17T13:12:19.958Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Vera Hadjida"}, "content": {"type": "text", "$t": "yearbirth: 1936, yeardeath: 2012, biography: Σπούδασε ζωγραφική και εσωτερική διακόσμηση στο  Kingston School of Art  στο Λονδίνο (1955 - 1959). Το 1959 επέστρεψε στη Κύπρο και άρχισε να εργάζεται, παράλληλα με την ενασχόληση της στη ζωγραφική, σε σχολεία Μέσης Εκπαίδευσης. Από το 1983 μέχρι το 1988 δίδαξε στη Παιδαγογική Ακαδημία. Έχει παρουσιάσει το έργο της σε ατομικές και ομαδικές εκθέσεις στη Κύπρο και στο εξωτερικό, Παρίσι, Μπιενάλε Νέων καλλιτεχνών της Μεσογείου, Βοστώνη, Έκθεση Κυπρίων Ζωγράφων, Τριενάλε Ινδιών, Μπιενάλε Σαο Πάολο, Λονδίνο, Εδιμβούργο, Ινστιτούτο Κοινοπολιτείας, Αθήνα, Ομαδική 10 Κυπρίων Καλλιτεχνών κ.α. Έργα της βρίσκονται στην Κυπριακή Πινακοθήκη Σύγχρονης Κυπριακής Τέχνης, σε πρεσβείες της Κύπρου στην Ουάσιγκτον, Νέα Υόρκη, Μόσχα, στην Τράπεζα της Ελλάδος και σε ιδιοτικές συλλογές στη Κύπρο και στο εξωτερικό., filename: assets/painters/portrait_placeholder.webp"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name": {"$t": "Vera Hadjida"}, "gsx$yearbirth": {"$t": "1936"}, "gsx$yeardeath": {"$t": "2012"}, "gsx$biography": {"$t": "Σπούδασε ζωγραφική και εσωτερική διακόσμηση στο  Kingston School of Art  στο Λονδίνο (1955 - 1959). Το 1959 επέστρεψε στη Κύπρο και άρχισε να εργάζεται, παράλληλα με την ενασχόληση της στη ζωγραφική, σε σχολεία Μέσης Εκπαίδευσης. Από το 1983 μέχρι το 1988 δίδαξε στη Παιδαγογική Ακαδημία. Έχει παρουσιάσει το έργο της σε ατομικές και ομαδικές εκθέσεις στη Κύπρο και στο εξωτερικό, Παρίσι, Μπιενάλε Νέων καλλιτεχνών της Μεσογείου, Βοστώνη, Έκθεση Κυπρίων Ζωγράφων, Τριενάλε Ινδιών, Μπιενάλε Σαο Πάολο, Λονδίνο, Εδιμβούργο, Ινστιτούτο Κοινοπολιτείας, Αθήνα, Ομαδική 10 Κυπρίων Καλλιτεχνών κ.α. Έργα της βρίσκονται στην Κυπριακή Πινακοθήκη Σύγχρονης Κυπριακής Τέχνης, σε πρεσβείες της Κύπρου στην Ουάσιγκτον, Νέα Υόρκη, Μόσχα, στην Τράπεζα της Ελλάδος και σε ιδιοτικές συλλογές στη Κύπρο και στο εξωτερικό."}, "gsx$filename": {"$t": "assets/painters/portrait_placeholder.webp"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-17T13:12:19.958Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Nicos Kouroussis"}, "content": {"type": "text", "$t": "yearbirth: 1937, biography: He was boring in Mitsero in 1937. He studied at the St. Martins and Hornsey College of Art in London.\n\nHe has presented his work in many solo and group exhibitions in Cyprus, Greece, the United States and throughout Europe. He represented Cyprus tice at the Venice Biennale (1972 and 1990)., filename: assets/painters/nicos_kouroussis.webp"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name": {"$t": "Nicos Kouroussis"}, "gsx$yearbirth": {"$t": "1937"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography": {"$t": "He was boring in Mitsero in 1937. He studied at the St. Martins and Hornsey College of Art in London.\n\nHe has presented his work in many solo and group exhibitions in Cyprus, Greece, the United States and throughout Europe. He represented Cyprus tice at the Venice Biennale (1972 and 1990)."}, "gsx$filename": {"$t": "assets/painters/nicos_kouroussis.webp"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-17T13:12:19.958Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "George Kyriakou"}, "content": {"type": "text", "$t": "yearbirth: 1940, biography: George Kyriacou was an elementary school teacher for two years before going on to study sculpture at Chelsea School of Art in London from 1961 to 1964. From the time he graduated until 1969 he worked as a secondary school art teacher. In 1969 he was appointed head of the arts sector of the Cultural Services of the Ministry of Education. Later, in 1972, he moved to Paris to study museology at La Sorbonne on a scholarship from The French government. He then studied at the Central London Polytechnic (1976-1977), where he obtained a Diploma in Arts and Leisure Administration. He has been a pioneer of contemporary sculpture in Cyprus and he has worked extensively in monumental sculpture.\n\nKyriacou’s habit of rescuing items, which have had another life, is integral to his process of working. He likes to explore and exploit the past life of abandoned objects, which have been discarded as useless and to give them a new life while still retaining a sense of the old., filename: assets/painters/george_kyriakou.webp"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name": {"$t": "George Kyriakou"}, "gsx$yearbirth": {"$t": "1940"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography": {"$t": "George Kyriacou was an elementary school teacher for two years before going on to study sculpture at Chelsea School of Art in London from 1961 to 1964. From the time he graduated until 1969 he worked as a secondary school art teacher. In 1969 he was appointed head of the arts sector of the Cultural Services of the Ministry of Education. Later, in 1972, he moved to Paris to study museology at La Sorbonne on a scholarship from The French government. He then studied at the Central London Polytechnic (1976-1977), where he obtained a Diploma in Arts and Leisure Administration. He has been a pioneer of contemporary sculpture in Cyprus and he has worked extensively in monumental sculpture.\n\nKyriacou’s habit of rescuing items, which have had another life, is integral to his process of working. He likes to explore and exploit the past life of abandoned objects, which have been discarded as useless and to give them a new life while still retaining a sense of the old."}, "gsx$filename": {"$t": "assets/painters/george_kyriakou.webp"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-17T13:12:19.958Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Angelos Makrides"}, "content": {"type": "text", "$t": "yearbirth: 1940, biography: Σπούδασε γλυπτική στην Ανωτάτη Σχολή Καλών Τεχνών Αθηνών (1961-1967) με δάσκαλο το Θανάση Απάρτη. Δούλεψε στο Παρίσι (1967-1969), στη Λευκωσία (1969-1974) και στην Αθήνα (1974-1986). Από το 1986 ζει και εργάζεται στην Κύπρο., filename: assets/painters/portrait_placeholder.webp"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name": {"$t": "Angelos Makrides"}, "gsx$yearbirth": {"$t": "1940"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography": {"$t": "Σπούδασε γλυπτική στην Ανωτάτη Σχολή Καλών Τεχνών Αθηνών (1961-1967) με δάσκαλο το Θανάση Απάρτη. Δούλεψε στο Παρίσι (1967-1969), στη Λευκωσία (1969-1974) και στην Αθήνα (1974-1986). Από το 1986 ζει και εργάζεται στην Κύπρο."}, "gsx$filename": {"$t": "assets/painters/portrait_placeholder.webp"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-17T13:12:19.958Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Michael Phinikarides"}, "content": {"type": "text", "$t": "yearbirth: 1940, yeardeath: 2005, biography: Γεννήθηκε στη Λευκωσία το 1940 και πέθανε στην Αθήνα το 2005. Σπούδασε στην ΑΣΚΤ. Δίδαξε στην κυπριακή εκπαίδευση και δούλεψε ως γραφίστας στην κυπριακή και κυρίως στην ελληνική τηλεόραση. Το έργο του διακρίνεται για τον κυπροκεντρικό του χαρακτήρα τόσο στο χρώμα όσο και στη θεματογραφία. Τα τελευταία χρόνια ασχολείτο με τη γυναικεία μορφή, που την απέδιδε με μια έκφραση κι ένα χρώμα κυπριακού αρχέτυπου., filename: assets/painters/portrait_placeholder.webp"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name": {"$t": "Michael Phinikarides"}, "gsx$yearbirth": {"$t": "1940"}, "gsx$yeardeath": {"$t": "2005"}, "gsx$biography": {"$t": "Γεννήθηκε στη Λευκωσία το 1940 και πέθανε στην Αθήνα το 2005. Σπούδασε στην ΑΣΚΤ. Δίδαξε στην κυπριακή εκπαίδευση και δούλεψε ως γραφίστας στην κυπριακή και κυρίως στην ελληνική τηλεόραση. Το έργο του διακρίνεται για τον κυπροκεντρικό του χαρακτήρα τόσο στο χρώμα όσο και στη θεματογραφία. Τα τελευταία χρόνια ασχολείτο με τη γυναικεία μορφή, που την απέδιδε με μια έκφραση κι ένα χρώμα κυπριακού αρχέτυπου."}, "gsx$filename": {"$t": "assets/painters/portrait_placeholder.webp"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-17T13:12:19.958Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Andreas Savvides"}, "content": {"type": "text", "$t": "yearbirth: 1930, yeardeath: 2016, biography: Ο Ανδρέας Σαββίδης γεννήθηκε στην Κερύνεια το 1930. Αποφοίτησε από το Παγκύπριο Γυμνάσιο, με δάσκαλο στην τέχνη τον Αδαμάντιο Διαμαντή. Το 1950-52 φοίτησε στο Διδασκαλικό Κολλέγιο Μόρφου, με δάσκαλο τον Τουρκοκύπριο Τζιεβτέτ Χουσεΐν. Εργάστηκε ως δάσκαλος στην πρότυπη Αστική Σχολή Αγίου Αντωνίου. Εκεί είχε την ευκαιρία να γνωρίσει τον Κώστα Οικονόμου και τον Ανδρέα Παπαδόπουλο. Μοιράζονταν τις ίδιες αντιλήψεις για την τέχνη στην εκπαίδευση. Με την ώθηση του επιθεωρητή τους Θεόδοτου Κάνθου, εφάρμοζαν νέες για την εποχή εκπαιδευτικές μεθόδους διδακτικής της τέχνης., filename: assets/painters/andreas_savvides.webp"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name": {"$t": "Andreas Savvides"}, "gsx$yearbirth": {"$t": "1930"}, "gsx$yeardeath": {"$t": "2016"}, "gsx$biography": {"$t": "Ο Ανδρέας Σαββίδης γεννήθηκε στην Κερύνεια το 1930. Αποφοίτησε από το Παγκύπριο Γυμνάσιο, με δάσκαλο στην τέχνη τον Αδαμάντιο Διαμαντή. Το 1950-52 φοίτησε στο Διδασκαλικό Κολλέγιο Μόρφου, με δάσκαλο τον Τουρκοκύπριο Τζιεβτέτ Χουσεΐν. Εργάστηκε ως δάσκαλος στην πρότυπη Αστική Σχολή Αγίου Αντωνίου. Εκεί είχε την ευκαιρία να γνωρίσει τον Κώστα Οικονόμου και τον Ανδρέα Παπαδόπουλο. Μοιράζονταν τις ίδιες αντιλήψεις για την τέχνη στην εκπαίδευση. Με την ώθηση του επιθεωρητή τους Θεόδοτου Κάνθου, εφάρμοζαν νέες για την εποχή εκπαιδευτικές μεθόδους διδακτικής της τέχνης."}, "gsx$filename": {"$t": "assets/painters/andreas_savvides.webp"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-17T13:12:19.958Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "George Sfikas"}, "content": {"type": "text", "$t": "yearbirth: 1943, biography: George Sfikas (Nicosia) lived and worked in England and Greece. He studied painting and sculpture in London at the Camberwell School of Art, Martin’s School of Art and the Institute of Education of the University of London. He presented his work in Cyprus, London, Paris Biennale and New Delhi Triennale. Sfikas represented Cyprus at the 45th Venice Biennale of Art., filename: assets/painters/portrait_placeholder.webp"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name": {"$t": "George Sfikas"}, "gsx$yearbirth": {"$t": "1943"}, "gsx$yeardeath": {"$t": ""}, "gsx$biography": {"$t": "George Sfikas (Nicosia) lived and worked in England and Greece. He studied painting and sculpture in London at the Camberwell School of Art, Martin’s School of Art and the Institute of Education of the University of London. He presented his work in Cyprus, London, Paris Biennale and New Delhi Triennale. Sfikas represented Cyprus at the 45th Venice Biennale of Art."}, "gsx$filename": {"$t": "assets/painters/portrait_placeholder.webp"}}, {"id": {"$t": ""}, "updated": {"$t": "2020-09-17T13:12:19.958Z"}, "category": [{"scheme": "http://schemas.google.com/spreadsheets/2006", "term": "http://schemas.google.com/spreadsheets/2006#list"}], "title": {"type": "text", "$t": "Stelios Votsis"}, "content": {"type": "text", "$t": "yearbirth: 1929, yeardeath: 2012, biography: Ο Στέλιος Βότσης γεννήθηκε στη Λάρνακα το 1929. Φοίτησε στην Αστική Σχολή Καλογερά και στη συνέχεια στο Εμπορικό Λύκειο Λάρνακας, με δάσκαλο τέχνης τον Βίκτωρα Ιωαννίδη. Από νωρίς έδειξε το ταλέντο του και ο Ιωαννίδης που το αναγνώρισε, τον επαινούσε και τον ενεθάρρυνε στον δρόμο της τέχνης. Σπούδασε στις Σχολές Καλών Τεχνών του Λονδίνου Saint Martin’s School of Art, Sir John College of Art και Royal Academy of Arts. Πήρε δίπλωμα το 1955 από το SLADE School of Art, University College, University of London., filename: assets/painters/stelios_votsis.webp"}, "link": [{"rel": "self", "type": "application/atom+xml", "href": ""}], "gsx$name": {"$t": "Stelios Votsis"}, "gsx$yearbirth": {"$t": "1929"}, "gsx$yeardeath": {"$t": "2012"}, "gsx$biography": {"$t": "Ο Στέλιος Βότσης γεννήθηκε στη Λάρνακα το 1929. Φοίτησε στην Αστική Σχολή Καλογερά και στη συνέχεια στο Εμπορικό Λύκειο Λάρνακας, με δάσκαλο τέχνης τον Βίκτωρα Ιωαννίδη. Από νωρίς έδειξε το ταλέντο του και ο Ιωαννίδης που το αναγνώρισε, τον επαινούσε και τον ενεθάρρυνε στον δρόμο της τέχνης. Σπούδασε στις Σχολές Καλών Τεχνών του Λονδίνου Saint Martin’s School of Art, Sir John College of Art και Royal Academy of Arts. Πήρε δίπλωμα το 1955 από το SLADE School of Art, University College, University of London."}, "gsx$filename": {"$t": "assets/painters/stelios_votsis.webp"}}]}}